MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F4A0RITB/mcu.h
typedef struct {
    __IO uint32_t F1NWPRT64;
    __IO uint32_t F1NWPRT65;
    __IO uint32_t F1NWPRT66;
    __IO uint32_t F1NWPRT67;
    __IO uint32_t F1NWPRT68;
    __IO uint32_t F1NWPRT69;
    __IO uint32_t F1NWPRT70;
    __IO uint32_t F1NWPRT71;
    __IO uint32_t F1NWPRT72;
    __IO uint32_t F1NWPRT73;
    __IO uint32_t F1NWPRT74;
    __IO uint32_t F1NWPRT75;
    __IO uint32_t F1NWPRT76;
    __IO uint32_t F1NWPRT77;
    __IO uint32_t F1NWPRT78;
    __IO uint32_t F1NWPRT79;
    __IO uint32_t F1NWPRT80;
    __IO uint32_t F1NWPRT81;
    __IO uint32_t F1NWPRT82;
    __IO uint32_t F1NWPRT83;
    __IO uint32_t F1NWPRT84;
    __IO uint32_t F1NWPRT85;
    __IO uint32_t F1NWPRT86;
    __IO uint32_t F1NWPRT87;
    __IO uint32_t F1NWPRT88;
    __IO uint32_t F1NWPRT89;
    __IO uint32_t F1NWPRT90;
    __IO uint32_t F1NWPRT91;
    __IO uint32_t F1NWPRT92;
    __IO uint32_t F1NWPRT93;
    __IO uint32_t F1NWPRT94;
    __IO uint32_t F1NWPRT95;
} stc_efm_f1nwprt2_bit_t;

typedef struct {
    __IO uint32_t F1NWPRT96;
    __IO uint32_t F1NWPRT97;
    __IO uint32_t F1NWPRT98;
    __IO uint32_t F1NWPRT99;
    __IO uint32_t F1NWPRT100;
    __IO uint32_t F1NWPRT101;
    __IO uint32_t F1NWPRT102;
    __IO uint32_t F1NWPRT103;
    __IO uint32_t F1NWPRT104;
    __IO uint32_t F1NWPRT105;
    __IO uint32_t F1NWPRT106;
    __IO uint32_t F1NWPRT107;
    __IO uint32_t F1NWPRT108;
    __IO uint32_t F1NWPRT109;
    __IO uint32_t F1NWPRT110;
    __IO uint32_t F1NWPRT111;
    __IO uint32_t F1NWPRT112;
    __IO uint32_t F1NWPRT113;
    __IO uint32_t F1NWPRT114;
    __IO uint32_t F1NWPRT115;
    __IO uint32_t F1NWPRT116;
    __IO uint32_t F1NWPRT117;
    __IO uint32_t F1NWPRT118;
    __IO uint32_t F1NWPRT119;
    __IO uint32_t F1NWPRT120;
    __IO uint32_t F1NWPRT121;
    __IO uint32_t F1NWPRT122;
    __IO uint32_t F1NWPRT123;
    __IO uint32_t F1NWPRT124;
    __IO uint32_t F1NWPRT125;
    __IO uint32_t F1NWPRT126;
    __IO uint32_t F1NWPRT127;
} stc_efm_f1nwprt3_bit_t;

typedef struct {
    __IO uint32_t CMPEN1;
    __IO uint32_t CMPEN2;
    __IO uint32_t CMPEN3;
    __IO uint32_t CMPEN4;
    __IO uint32_t OSCSTPEN;
    __IO uint32_t PWMSEN0;
    __IO uint32_t PWMSEN1;
    __IO uint32_t PWMSEN2;
    __IO uint32_t PWMSEN3;
    __IO uint32_t PWMSEN4;
    __IO uint32_t PWMSEN5;
    __IO uint32_t PWMSEN6;
    __IO uint32_t PWMSEN7;
    uint32_t RESERVED0[3];
    __IO uint32_t PORTINEN1;
    __IO uint32_t PORTINEN2;
    __IO uint32_t PORTINEN3;
    __IO uint32_t PORTINEN4;
    uint32_t RESERVED1[2];
    __IO uint32_t INVSEL1;
    __IO uint32_t INVSEL2;
    __IO uint32_t INVSEL3;
    __IO uint32_t INVSEL4;
    uint32_t RESERVED2[6];
} stc_emb_ctl1_bit_t;

typedef struct {
    __IO uint32_t PWMLV0;
    __IO uint32_t PWMLV1;
    __IO uint32_t PWMLV2;
    __IO uint32_t PWMLV3;
    __IO uint32_t PWMLV4;
    __IO uint32_t PWMLV5;
    __IO uint32_t PWMLV6;
    __IO uint32_t PWMLV7;
    uint32_t RESERVED0[10];
    __IO uint32_t NFEN1;
    uint32_t RESERVED1[2];
    __IO uint32_t NFEN2;
    uint32_t RESERVED2[2];
    __IO uint32_t NFEN3;
    uint32_t RESERVED3[2];
    __IO uint32_t NFEN4;
    uint32_t RESERVED4[4];
} stc_emb_ctl2_bit_t;

typedef struct {
    __IO uint32_t SOE;
    uint32_t RESERVED0[31];
} stc_emb_soe_bit_t;

typedef struct {
    uint32_t RESERVED0[1];
    __I  uint32_t PWMSF;
    __I  uint32_t CMPF;
    __I  uint32_t OSF;
    uint32_t RESERVED1[1];
    __I  uint32_t PWMST;
    __I  uint32_t CMPST;
    __I  uint32_t OSST;
    __I  uint32_t PORTINF1;
    __I  uint32_t PORTINF2;
    __I  uint32_t PORTINF3;
    __I  uint32_t PORTINF4;
    uint32_t RESERVED2[2];
    __I  uint32_t PORTINST1;
    __I  uint32_t PORTINST2;
    __I  uint32_t PORTINST3;
    __I  uint32_t PORTINST4;
    uint32_t RESERVED3[14];
} stc_emb_stat_bit_t;

typedef struct {
    uint32_t RESERVED0[1];
    __O  uint32_t PWMSFCLR;
    __O  uint32_t CMPFCLR;
    __O  uint32_t OSFCLR;
    uint32_t RESERVED1[4];
    __O  uint32_t PORTINFCLR1;
    __O  uint32_t PORTINFCLR2;
    __O  uint32_t PORTINFCLR3;
    __O  uint32_t PORTINFCLR4;
    uint32_t RESERVED2[20];
} stc_emb_statclr_bit_t;

typedef struct {
    uint32_t RESERVED0[1];
    __IO uint32_t PWMSINTEN;
    __IO uint32_t CMPINTEN;
    __IO uint32_t OSINTEN;
    uint32_t RESERVED1[4];
    __IO uint32_t PORTININTEN1;
    __IO uint32_t PORTININTEN2;
    __IO uint32_t PORTININTEN3;
    __IO uint32_t PORTININTEN4;
    uint32_t RESERVED2[20];
} stc_emb_inten_bit_t;

typedef struct {
    uint32_t RESERVED0[1];
    __IO uint32_t PWMRSEL;
    __IO uint32_t CMPRSEL;
    __IO uint32_t OSRSEL;
    uint32_t RESERVED1[4];
    __IO uint32_t PORTINRSEL1;
    __IO uint32_t PORTINRSEL2;
    __IO uint32_t PORTINRSEL3;
    __IO uint32_t PORTINRSEL4;
    uint32_t RESERVED2[20];
} stc_emb_rlssel_bit_t;

typedef struct {
    __IO uint32_t IFSEL;
    uint32_t RESERVED0[3];
    __IO uint32_t RCKINV;
    __IO uint32_t TCKINV;
    uint32_t RESERVED1[26];
} stc_eth_mac_ifconfr_bit_t;

typedef struct {
    uint32_t RESERVED0[2];
    __IO uint32_t RE;
    __IO uint32_t TE;
    __IO uint32_t DC;
    uint32_t RESERVED1[2];
    __IO uint32_t ACS;
    uint32_t RESERVED2[1];
    __IO uint32_t DRTY;
    __IO uint32_t IPCO;
    __IO uint32_t DM;
    __IO uint32_t LM;
    __IO uint32_t DO;
    __IO uint32_t FES;
    uint32_t RESERVED3[1];
    __IO uint32_t DCRS;
    uint32_t RESERVED4[5];
    __IO uint32_t MJB;
    __IO uint32_t MWD;
    uint32_t RESERVED5[1];
    __IO uint32_t CST;
    uint32_t RESERVED6[6];
} stc_eth_mac_configr_bit_t;

typedef struct {
    __IO uint32_t PR;
    __IO uint32_t HUC;
    __IO uint32_t HMC;
    __IO uint32_t DAIF;
    __IO uint32_t PMF;
    __IO uint32_t DBF;
    uint32_t RESERVED0[2];
    __IO uint32_t SAIF;
    __IO uint32_t SAF;
    __IO uint32_t HPF;
    uint32_t RESERVED1[5];
    __IO uint32_t VTFE;
    uint32_t RESERVED2[3];
    __IO uint32_t IPFE;
    __IO uint32_t DNTU;
    uint32_t RESERVED3[9];
    __IO uint32_t RA;
} stc_eth_mac_fltctlr_bit_t;

typedef struct {
    __IO uint32_t SMIB;
    __IO uint32_t SMIW;
    uint32_t RESERVED0[30];
} stc_eth_mac_smiaddr_bit_t;

